# Lecture 6: Pandas

Pandas is a python library designed to make many common types of data analysis straightforward. It borrows heavily from R. 

### Memory structure

The basic datastructure in Pandas is a DataFrame. These data frames are very similar to Numpy Structured Arrays, except how they are stored in memory is completely different. 

Structured arrays consist of a Numpy array with an entry for each row in the structured array, and each entry is a tuple. 

Pandas data frames consist of a dictionary-like object (with keys indicating rows or indexes) containing a set of columns. Each column is stored as a Numpy 1D array (actually, Pandas has a wapper for the 1D array called a Series that shows up here and there) that consists of that array plus an additional array that contains indexes.

This hybrid representation makes computations within a column very fast, and computations across columns not particularly ineffient because of the extra index array stored with each column. The sacrifice in this case is storage space, Pandas dataframes take up more memory than Numpy or Scipy arrays.

### Advantages

Pandas is designed to a few things very well. It is incredibly useful for grouping data, aggregating and processing these groups, and reshaping data. Support for time-series analyses in Pandas is also strong with built-in date and time representations.

In [3]:
import numpy
import pandas

## 6.1 Reading and writing Pandas data frames

In [4]:
# read a data file into pandas
data = pandas.read_csv("iris.txt", delim_whitespace=True, header=None)

In [5]:
# save the datafile as a csv
data.to_csv("tmp.csv", sep=",")

## 6.2 Getting some simple information

In [6]:
# first 5 rows
print(data.head())
# last 5 rows
print(data.tail())

     0    1    2    3       4
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa
2  4.7  3.2  1.3  0.2  setosa
3  4.6  3.1  1.5  0.2  setosa
4  5.0  3.6  1.4  0.2  setosa
       0    1    2    3          4
145  6.7  3.0  5.2  2.3  virginica
146  6.3  2.5  5.0  1.9  virginica
147  6.5  3.0  5.2  2.0  virginica
148  6.2  3.4  5.4  2.3  virginica
149  5.9  3.0  5.1  1.8  virginica

In [7]:
data.columns = ["sepal_length", "sepal_width", "petal_length", "petal_width", "type"]
print(data.head(10))

   sepal_length  sepal_width  petal_length  petal_width    type
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [8]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
type            150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB
None

In [9]:
print(data.describe())

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [10]:
# pandas has some nice default printing options when not passed through print
data.head()

   sepal_length  sepal_width  petal_length  petal_width    type
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## 6.3 Indexing data frames

As with any data structure, it is important to be able to access subsets of the dataframe. Pandas has tools for accessing both rows and columns in a number of ways.

In [11]:
# index rows with just a set of indices (no comma)
print(data[:5])
# data[:5,] # causes an error!

   sepal_length  sepal_width  petal_length  petal_width    type
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [12]:
# print the names of the columns
print(data.columns)
print(list(data))

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'type'], dtype='object')
['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'type']

In [13]:
# single column (note that only the first 5 rows are selected):
print(data['sepal_width'][:5])

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_width, dtype: float64

In [14]:
# more than one column:
print(data[['sepal_width', 'petal_width']][:5])

   sepal_width  petal_width
0          3.5          0.2
1          3.0          0.2
2          3.2          0.2
3          3.1          0.2
4          3.6          0.2

In [15]:
# boolean indexing works
print(data[(data['type'] == "virginica") & (data['petal_length'] < 5)])

     sepal_length  sepal_width  petal_length  petal_width       type
106           4.9          2.5           4.5          1.7  virginica
121           5.6          2.8           4.9          2.0  virginica
123           6.3          2.7           4.9          1.8  virginica
126           6.2          2.8           4.8          1.8  virginica
127           6.1          3.0           4.9          1.8  virginica
138           6.0          3.0           4.8          1.8  virginica

In [16]:
# rows can also have names:
summary = data.describe()
summary

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [17]:
# and we can index rows using the loc property:
print(summary.loc['mean'])
print()
print(summary.loc[['mean', '50%']])
print()
print(summary.loc['25%':'75%'])

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
Name: mean, dtype: float64

      sepal_length  sepal_width  petal_length  petal_width
mean      5.843333     3.057333         3.758     1.199333
50%       5.800000     3.000000         4.350     1.300000

     sepal_length  sepal_width  petal_length  petal_width
25%           5.1          2.8          1.60          0.3
50%           5.8          3.0          4.35          1.3
75%           6.4          3.3          5.10          1.8

In [18]:
# or by row index number using iloc:
print(summary.iloc[1:3])

      sepal_length  sepal_width  petal_length  petal_width
mean      5.843333     3.057333      3.758000     1.199333
std       0.828066     0.435866      1.765298     0.762238

## Exercise 6.3

Write a function wine_quality_split() that takes as input a column name (stored as a string) from the wine quality dataset (winequality-red.csv) and returns a tuple containing two values: the mean value of the named column for the higher quality wines and the lower quality wines (use above and below the median quality score to group the wines).

In [ ]:
def wine_quality_split(name):
    return ...

In [ ]:
# testing
name = 'fixed acidity'
print( wine_quality_split(name) )

name = 'chlorides'
print( wine_quality_split(name) )

## 6.4 Reshaping and pivot tables

### 6.4.1 Summarizing data

Perhaps one of the most useful way to summarize data and understand it is to simply count entries. Here we show a few exaples of recoding continuous values into a binary value and then calcuating table counts.

In [19]:
# some summary functions like crosstab work with selected columns
pandas.crosstab(data['petal_width'] > 2, columns=data['type'])

type         setosa  versicolor  virginica
petal_width
False            50          50         27
True              0           0         23

In [20]:
# rows can be nested hierarchically
p_w_2 = data['petal_width'] > 2
p_l_2 = data['petal_length'] > 2
pandas.crosstab([p_w_2, p_l_2], columns=data['type'])

type                      setosa  versicolor  virginica
petal_width petal_length
False       False             50           0          0
            True               0          50         27
True        True               0           0         23

In [21]:
# columns can be nested hierarchically
pandas.crosstab(data['type'], [p_w_2, p_l_2], 
                colnames=["Width > 2", "Lenght > 2"], 
                rownames=["Flower Type"])

Width > 2   False       True
Lenght > 2  False True  True
Flower Type
setosa         50     0     0
versicolor      0    50     0
virginica       0    27    23

In [22]:
# count up the values
data['type'].value_counts()

virginica     50
setosa        50
versicolor    50
Name: type, dtype: int64

### 6.4.2 Pivot tables

Pivot tables are a useful tool for summarizing data along different groupings. Pandas provides a wapper function called pivot_table for constructing these tables.

In [23]:
example = pandas.DataFrame({'A': ['one', 'one', 'two', 'three'] * 6,
                       'B': ['X', 'Y', 'Z'] * 8,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 4,
                       'D': numpy.random.randn(24),
                       'E': numpy.random.randn(24)})
example.head(10)

       A  B    C         D         E
0    one  X  foo -0.179317  0.104595
1    one  Y  foo  0.686019  0.033038
2    two  Z  foo -0.266102 -0.479318
3  three  X  bar -0.663044 -0.923719
4    one  Y  bar  0.633710  1.017073
5    one  Z  bar -0.148903  1.522990
6    two  X  foo -0.198429  0.809415
7  three  Y  foo  1.144233 -0.659778
8    one  Z  foo -1.649386 -0.396220
9    one  X  bar -0.221616 -1.191335

In [24]:
# build a pivot table:
# columns parameter specifies the column types, index specifies the rows
pandas.pivot_table(example, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   X  0.318162 -0.521300
      Y  0.227359  0.880656
      Z -0.296988 -0.578460
three X -0.880656       NaN
      Y       NaN  0.417582
      Z -0.373275       NaN
two   X       NaN -0.183381
      Y -0.176899       NaN
      Z       NaN -0.481973

In [25]:
# more than one column in the dataframe can be used for a value
# and pandas will automatically guess which columns to use
pandas.pivot_table(example, index=['A', 'B'], columns=['C'])

                D                   E
C             bar       foo       bar       foo
A     B
one   X  0.318162 -0.521300 -0.362185  0.223298
      Y  0.227359  0.880656 -0.175077 -0.151705
      Z -0.296988 -0.578460  1.106667 -0.347351
three X -0.880656       NaN -0.575937       NaN
      Y       NaN  0.417582       NaN -0.491877
      Z -0.373275       NaN -0.931858       NaN
two   X       NaN -0.183381       NaN  0.966485
      Y -0.176899       NaN -0.365261       NaN
      Z       NaN -0.481973       NaN -0.677411

In [26]:
# more than one column can be specified
pandas.pivot_table(example, values=['D','E'], index=['B'], columns=['A', 'C'])

          D                                                           E  \
A       one               three                 two                 one
C       bar       foo       bar       foo       bar       foo       bar
B
X  0.318162 -0.521300 -0.880656       NaN       NaN -0.183381 -0.362185
Y  0.227359  0.880656       NaN  0.417582 -0.176899       NaN -0.175077
Z -0.296988 -0.578460 -0.373275       NaN       NaN -0.481973  1.106667


A               three                 two
C       foo       bar       foo       bar       foo
B
X  0.223298 -0.575937       NaN       NaN  0.966485
Y -0.151705       NaN -0.491877 -0.365261       NaN
Z -0.347351 -0.931858       NaN       NaN -0.677411

In [27]:
# default aggregation is mean
# but we can specify other aggreation functions:
pandas.pivot_table(example, values='D', index=['B'], 
                   columns=['A', 'C'], aggfunc=numpy.sum)

A       one               three                 two
C       bar       foo       bar       foo       bar       foo
B
X  0.636324 -1.042599 -1.761312       NaN       NaN -0.366763
Y  0.454718  1.761313       NaN  0.835164 -0.353799       NaN
Z -0.593975 -1.156920 -0.746550       NaN       NaN -0.963946

In [28]:
# pivot_table has many additional optional parameters but margins is a useful one:
# note that we are also using pivot_table as a method of the dataframe
example.pivot_table(index=['A', 'B'], columns='C', 
                    margins=True, aggfunc=numpy.median)

                D                             E
C             bar       foo       All       bar       foo       All
A     B
one   X  0.318162 -0.521300 -0.200466 -0.362185  0.223298  0.223298
      Y  0.227359  0.880656  0.659864 -0.175077 -0.151705 -0.151705
      Z -0.296988 -0.578460 -0.296988  1.106667 -0.347351  0.195931
three X -0.880656       NaN -0.880656 -0.575937       NaN -0.575937
      Y       NaN  0.417582  0.417582       NaN -0.491877 -0.491877
      Z -0.373275       NaN -0.373275 -0.931858       NaN -0.931858
two   X       NaN -0.183381 -0.183381       NaN  0.966485  0.966485
      Y -0.176899       NaN -0.176899 -0.365261       NaN -0.365261
      Z       NaN -0.481973 -0.481973       NaN -0.677411 -0.677411
All     -0.200304 -0.188873 -0.188873 -0.534335 -0.311230 -0.311230

## Exercise 6.4

Part A: Using the winequality-red dataset, build a cross tab of the frequency of quality (along rows) and amount of alcohol (along columns, rounded to a whole number).

Part B: Generate a pivot table that shows the average density of a wine as a function of the quality and rounded alcohol values.

## 6.5 Groupby

One of the most powerful features in pandas is the ability to group dataframes by specific values and then perform calculations on those groups. These features are directly stolen from how R does this.

In [29]:
df = pandas.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 
                              'foo', 'bar', 'foo', 'foo'],
                       'B' : ['one', 'one', 'two', 'three', 
                              'two', 'two', 'one', 'three'],
                       'C' : numpy.random.randn(8),
                       'D' : numpy.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.146088 -0.442216
1  bar    one  1.324349  0.410504
2  foo    two -0.348405  0.232167
3  bar  three -0.334014 -1.023866
4  foo    two  0.472632 -1.054217
5  bar    two -0.918816 -0.091757
6  foo    one -0.355082  1.524157
7  foo  three -1.786135 -0.232815

In [30]:
# group by a single column
df.groupby('A').describe()

                  C         D
A
bar count  3.000000  3.000000
    mean   0.023840 -0.235039
    std    1.163611  0.727841
    min   -0.918816 -1.023866
    25%   -0.626415 -0.557811
    50%   -0.334014 -0.091757
    75%    0.495167  0.159374
    max    1.324349  0.410504
foo count  5.000000  5.000000
    mean  -0.374180  0.005415
    std    0.863484  0.966688
    min   -1.786135 -1.054217
    25%   -0.355082 -0.442216
    50%   -0.348405 -0.232815
    75%    0.146088  0.232167
    max    0.472632  1.524157

In [31]:
# group by more than one column
df.groupby(['A', 'B']).describe()

                        C         D
A   B
bar one   count  1.000000  1.000000
          mean   1.324349  0.410504
          std         NaN       NaN
          min    1.324349  0.410504
          25%    1.324349  0.410504
          50%    1.324349  0.410504
          75%    1.324349  0.410504
          max    1.324349  0.410504
    three count  1.000000  1.000000
          mean  -0.334014 -1.023866
          std         NaN       NaN
          min   -0.334014 -1.023866
          25%   -0.334014 -1.023866
          50%   -0.334014 -1.023866
          75%   -0.334014 -1.023866
          max   -0.334014 -1.023866
    two   count  1.000000  1.000000
          mean  -0.918816 -0.091757
          std         NaN       NaN
          min   -0.918816 -0.091757
          25%   -0.918816 -0.091757
          50%   -0.918816 -0.091757
          75%   -0.918816 -0.091757
          max   -0.918816 -0.091757
foo one   count  2.000000  2.000000
          mean  -0.104497  0.540970
          std    0.354381  1.390435
          min   -0.355082 -0.442216
          25%   -0.229790  0.049377
          50%   -0.104497  0.540970
          75%    0.020795  1.032564
          max    0.146088  1.524157
    three count  1.000000  1.000000
          mean  -1.786135 -0.232815
          std         NaN       NaN
          min   -1.786135 -0.232815
          25%   -1.786135 -0.232815
          50%   -1.786135 -0.232815
          75%   -1.786135 -0.232815
          max   -1.786135 -0.232815
    two   count  2.000000  2.000000
          mean   0.062114 -0.411025
          std    0.580561  0.909611
          min   -0.348405 -1.054217
          25%   -0.143145 -0.732621
          50%    0.062114 -0.411025
          75%    0.267373 -0.089429
          max    0.472632  0.232167

In [32]:
# by default, groupby sorts the groups (alphabetically or numerically)
print(df.groupby('B').mean())
print()
print(df.groupby('B', sort=False).mean())

              C         D
B
one    0.371785  0.497482
three -1.060075 -0.628340
two   -0.264863 -0.304602

              C         D
B
one    0.371785  0.497482
two   -0.264863 -0.304602
three -1.060075 -0.628340

### 6.5.1 Accessing groups and iterating

The object created by the function groupy() is actually a list that can be iterated across to perform actions on each group of the data. Pandas provides some vectorized functions and others can be written:

In [33]:
# can access a single group
print(df.groupby('A').get_group('bar'))

     A      B         C         D
1  bar    one  1.324349  0.410504
3  bar  three -0.334014 -1.023866
5  bar    two -0.918816 -0.091757

In [34]:
# iterate through all groups
for name, group in df.groupby(['A', 'B']):
    print(name)
    print(group)

('bar', 'one')
     A    B         C         D
1  bar  one  1.324349  0.410504
('bar', 'three')
     A      B         C         D
3  bar  three -0.334014 -1.023866
('bar', 'two')
     A    B         C         D
5  bar  two -0.918816 -0.091757
('foo', 'one')
     A    B         C         D
0  foo  one  0.146088 -0.442216
6  foo  one -0.355082  1.524157
('foo', 'three')
     A      B         C         D
7  foo  three -1.786135 -0.232815
('foo', 'two')
     A    B         C         D
2  foo  two -0.348405  0.232167
4  foo  two  0.472632 -1.054217

### 6.5.2 Aggregation

Aggregation changes the number of rows or indices within the dataframe. We already saw one way to aggregate a group: describe(). There are many, many others:

- count
- cumcount
- first
- head
- last
- max
- mean
- median
- min
- nth
- prod
- size
- sem
- std
- sum
- var
- tail
- agg
- all
- any
- bfill
- corr
- count
- cov
- cummax
- cummin
- cumprod
- cumsum
- describe
- diff
- ffill
- fillna
- idxmax
- idxmin
- mad
- pct_change
- quantile
- rank
- resample
- shift
- size
- skew
- take
- tshift
- nlargest
- nsmallest
- value_counts
- corrwith

In [35]:
# a few examples:
print(df.groupby('A').size())
print()
print(df.groupby('A').max())
print()
print(df.groupby('A').agg([numpy.sum, numpy.mean, numpy.std]))

A
bar    3
foo    5
dtype: int64

       B         C         D
A
bar  two  1.324349  0.410504
foo  two  0.472632  1.524157

            C                            D
          sum     mean       std       sum      mean       std
A
bar  0.071519  0.02384  1.163611 -0.705118 -0.235039  0.727841
foo -1.870902 -0.37418  0.863484  0.027076  0.005415  0.966688

## Exercise 6.5

Using the iris dataset, group by the type of flower and compute the correlation between the first four variables in the dataset.

In [36]:
iris = pandas.read_csv("iris.txt", delim_whitespace=True, header=None)
iris.columns = ["sepal_length", "sepal_width", "petal_length", "petal_width", "type"]

## 6.6 Concatinate, Join, and Merge

### 6.6.1 Appending a row or column to a dataframe

In [37]:
# append a row:
df = pandas.DataFrame(numpy.random.randn(8, 4), columns=['A','B','C','D'])
print(df)
s = df.iloc[3]
print(df.append(s, ignore_index=True))

          A         B         C         D
0  1.293880 -1.446702  1.762905 -0.060412
1 -1.016272 -0.921121 -0.525454  0.043935
2  1.444647  0.105996 -0.888277  1.198607
3  0.786995  1.561960 -0.735969 -0.078286
4 -0.429689 -0.289493 -1.087099 -1.248062
5 -0.567823  1.017906 -1.603443 -0.507635
6  1.424633  0.552400 -0.666904 -0.017415
7 -2.015980 -0.769756  1.459848 -0.828240
          A         B         C         D
0  1.293880 -1.446702  1.762905 -0.060412
1 -1.016272 -0.921121 -0.525454  0.043935
2  1.444647  0.105996 -0.888277  1.198607
3  0.786995  1.561960 -0.735969 -0.078286
4 -0.429689 -0.289493 -1.087099 -1.248062
5 -0.567823  1.017906 -1.603443 -0.507635
6  1.424633  0.552400 -0.666904 -0.017415
7 -2.015980 -0.769756  1.459848 -0.828240
8  0.786995  1.561960 -0.735969 -0.078286

In [38]:
# append a column:
df['E'] = numpy.random.random(df.shape[0])
print(df)

          A         B         C         D         E
0  1.293880 -1.446702  1.762905 -0.060412  0.692314
1 -1.016272 -0.921121 -0.525454  0.043935  0.279933
2  1.444647  0.105996 -0.888277  1.198607  0.458337
3  0.786995  1.561960 -0.735969 -0.078286  0.801729
4 -0.429689 -0.289493 -1.087099 -1.248062  0.744164
5 -0.567823  1.017906 -1.603443 -0.507635  0.494574
6  1.424633  0.552400 -0.666904 -0.017415  0.643389
7 -2.015980 -0.769756  1.459848 -0.828240  0.388584

In [39]:
# delete that column
del df['E']
print(df.head())

          A         B         C         D
0  1.293880 -1.446702  1.762905 -0.060412
1 -1.016272 -0.921121 -0.525454  0.043935
2  1.444647  0.105996 -0.888277  1.198607
3  0.786995  1.561960 -0.735969 -0.078286
4 -0.429689 -0.289493 -1.087099 -1.248062

### 6.6.2 Concatinate data frames

In [40]:
df1 = pandas.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                       index=[0, 1, 2, 3])

df2 = pandas.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                       index=[4, 5, 6, 7])

df3 = pandas.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                       index=[8, 9, 10, 11])

df4 = pandas.DataFrame({'E': ['E2', 'E3', 'E6', 'E7'],
                        'F': ['F2', 'F3', 'F6', 'F7'],
                        'G': ['G2', 'G3', 'G6', 'G7']},
                       index=[0, 1, 2, 3])
print(df1)
print()
print(df2)
print()
print(df3)
print()
print(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

    E   F   G
0  E2  F2  G2
1  E3  F3  G3
2  E6  F6  G6
3  E7  F7  G7

In [41]:
# it is straightforward to build one dataframe
# note: this is numpy.concatinate under the hood so it is expensive in time and memory!
dfs = [df1, df2, df3]
pandas.concat(dfs)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [42]:
# more interestingly, we can add pandas indexes
result = pandas.concat(dfs, keys=['x', 'y', 'z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [43]:
# can then use these indexes to pull out individual dataframes:
result.loc['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

### 6.6.3 Specifying rows or columns for the concatination

In [44]:
# pandas will default to looking to concatinate rows together
print(pandas.concat([df1, df4]))

     A    B    C    D    E    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   E2   F2   G2
1  NaN  NaN  NaN  NaN   E3   F3   G3
2  NaN  NaN  NaN  NaN   E6   F6   G6
3  NaN  NaN  NaN  NaN   E7   F7   G7

In [45]:
# you can specify which axis to merge along:

# default behavior
print(pandas.concat([df1, df4], axis=0))

# concatinate columns with the same index together!
print(pandas.concat([df1, df4], axis=1))

     A    B    C    D    E    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   E2   F2   G2
1  NaN  NaN  NaN  NaN   E3   F3   G3
2  NaN  NaN  NaN  NaN   E6   F6   G6
3  NaN  NaN  NaN  NaN   E7   F7   G7
    A   B   C   D   E   F   G
0  A0  B0  C0  D0  E2  F2  G2
1  A1  B1  C1  D1  E3  F3  G3
2  A2  B2  C2  D2  E6  F6  G6
3  A3  B3  C3  D3  E7  F7  G7

In [46]:
# append can also be used but has fewer options:
df1.append([df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [47]:
# if you are performing many concatinations, 
# it's much more efficient to use list comprehensions to do a single concatination:
if False:
    dfs = [ process_your_file(f) for f in files ]
    result = pandas.concat(dfs)

## 6.7 Joins

### 6.7.1 Joins using the Concat function

Joining data frames is the process of combining two dataframes. This becomes interesting and complex when some (but not all) of the row indicies and column names overlap between the two dataframes.

In [48]:
# df5 and df1 share some indicies and names:
df5 = pandas.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                        'D': ['D2', 'D3', 'D6', 'D7'],
                        'F': ['F2', 'F3', 'F6', 'F7']},
                       index=[2, 3, 6, 7])
print(df1)
print()
print(df5)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [49]:
# the default behavior of concat is to not duplicate column names 
# but to duplicate row indices
pandas.concat([df1, df5])

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [50]:
# but the axis parameter can get concat to create duplicate 
# columns and only unique rows
pandas.concat([df1, df5], axis=1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [51]:
# The default in this case is an outer join:
# all rows are retained regardless of each column is present in the row
# this can produce NaN values
pandas.concat([df1, df5], axis=1, join='outer')

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [52]:
# can also specify an inner join:
# each row must have matching columns
# this can lead to dropping rows
pandas.concat([df1, df5], axis=1, join='inner')

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [53]:
# concat can also be told to ignore duplicate indices
# this results in new index values being created for conflicts
print(df1)
print()
print(df5)
pandas.concat([df1, df5], ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### 6.7.2 Joins using the Join function

Join is a convenience function in pandas for joining two dataframes. It is a wrapper around the merge function.

In [54]:
left = pandas.DataFrame({'A': ['A0', 'A1', 'A2'],
                         'B': ['B0', 'B1', 'B2']},
                        index=['K0', 'K1', 'K2'])
right = pandas.DataFrame({'C': ['C0', 'C2', 'C3'],
                          'D': ['D0', 'D2', 'D3']},
                         index=['K0', 'K2', 'K3'])
print(left)
print()
print(right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [55]:
# default is a left join: 
# all indexes from the left dataframe are kept as well as 
# any indexes in the right that occur in the left
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [56]:
# we can also specify a right join
left.join(right, how="right")

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [57]:
# or an outer join that keeps all indexes
left.join(right, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [58]:
# or an inner join that keep all complete indexes
left.join(right, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### 6.7.3 Joining by key

Often datasets are related by a shared key. These are often referred to as relational datasets or databases. Pandas makes it easy to merge across shared key values.

In [59]:
books = pandas.DataFrame({'title': ['Title1', 'Title2', 'Title3', 'Year4'],
                         'year': ['Year1', 'Year2', 'Year3', 'Year4'],
                         'key': ['A1', 'A2', 'A1', 'A2']})
authors = pandas.DataFrame({'first_name': ['F1', 'F2', 'F3'],
                          'last_name': ['L1', 'L2', 'L3']},
                          index=['A1', 'A2', 'A3'])
print(books)
print()
print(authors)

  key   title   year
0  A1  Title1  Year1
1  A2  Title2  Year2
2  A1  Title3  Year3
3  A2   Year4  Year4

   first_name last_name
A1         F1        L1
A2         F2        L2
A3         F3        L3

In [60]:
books.join(authors, on="key")

  key   title   year first_name last_name
0  A1  Title1  Year1         F1        L1
1  A2  Title2  Year2         F2        L2
2  A1  Title3  Year3         F1        L1
3  A2   Year4  Year4         F2        L2

### 6.7.4 Joins using the merge function

Merge has more options than Join. Specifically, it is possible to specify a key in both dataframes to merge based on, to specify multiple keys within each dataframe, etc.

One really nice feature is to include a new column indicating which dataframe the row came from.

In [61]:
pandas.merge(df1, df5, how='outer', indicator='indicator_column')

     A   B    C   D    F indicator_column
0   A0  B0   C0  D0  NaN        left_only
1   A1  B1   C1  D1  NaN        left_only
2   A2  B2   C2  D2   F2             both
3   A3  B3   C3  D3   F3             both
4  NaN  B6  NaN  D6   F6       right_only
5  NaN  B7  NaN  D7   F7       right_only

## Exercise 6.7

Read in the three iris datasets (a, b, and c) and combine them into a single dataframe. Add a column to indicate which dataset they came from.

Did you use concatinate, merge, join, or another function? Why? What aspects of the data would make you change your choice?

## 6.8 Time series

Pandas has incredibly powerful tools for processing data based on time series.

In [62]:
# create a range of dates
rng = pandas.date_range('1/1/2011', periods=24*8, freq='H')
print(rng.summary())

# a series of numbers with those dates as an index
ts = pandas.Series(numpy.random.randint(0, 500, len(rng)), index=rng)
print(ts.head(10))

DatetimeIndex: 192 entries, 2011-01-01 00:00:00 to 2011-01-08 23:00:00
Freq: H
2011-01-01 00:00:00    231
2011-01-01 01:00:00    288
2011-01-01 02:00:00    269
2011-01-01 03:00:00    372
2011-01-01 04:00:00     56
2011-01-01 05:00:00    122
2011-01-01 06:00:00    318
2011-01-01 07:00:00    491
2011-01-01 08:00:00    408
2011-01-01 09:00:00    383
Freq: H, dtype: int64

In [63]:
# convert time zone
ts_utc = ts.tz_localize('UTC')
print(ts_utc.head())

# convert to another time zone
print(ts_utc.tz_convert('US/Eastern').head())

2011-01-01 00:00:00+00:00    231
2011-01-01 01:00:00+00:00    288
2011-01-01 02:00:00+00:00    269
2011-01-01 03:00:00+00:00    372
2011-01-01 04:00:00+00:00     56
Freq: H, dtype: int64
2010-12-31 19:00:00-05:00    231
2010-12-31 20:00:00-05:00    288
2010-12-31 21:00:00-05:00    269
2010-12-31 22:00:00-05:00    372
2010-12-31 23:00:00-05:00     56
Freq: H, dtype: int64

### 6.9.1 Transform the time increments

In [64]:
# recode the frequency of the time steps
# fill in missing data from the previous step
print(ts.asfreq('45Min', method='pad').head(10))

2011-01-01 00:00:00    231
2011-01-01 00:45:00    231
2011-01-01 01:30:00    288
2011-01-01 02:15:00    269
2011-01-01 03:00:00    372
2011-01-01 03:45:00    372
2011-01-01 04:30:00     56
2011-01-01 05:15:00    122
2011-01-01 06:00:00    318
2011-01-01 06:45:00    318
Freq: 45T, dtype: int64

In [69]:
# bin the timestamps into days (from hours) and return the mean value 
print(ts.resample('D').mean())

2011-01-01    256.750000
2011-01-02    270.208333
2011-01-03    248.333333
2011-01-04    254.041667
2011-01-05    267.583333
2011-01-06    251.583333
2011-01-07    197.666667
2011-01-08    203.666667
Freq: D, dtype: float64

In [71]:
# compute rolling means
lag = ts.rolling(window=5, min_periods=1,center=False).mean()
print(lag.head(10))
print()

# compute rolling max
roll_max = ts.rolling(3, min_periods=1).max()
print(roll_max.head(10))

# 10+ rolling functions in pandas 
# including a rolling_apply that takes an arbitrary function

2011-01-01 00:00:00    231.000000
2011-01-01 01:00:00    259.500000
2011-01-01 02:00:00    262.666667
2011-01-01 03:00:00    290.000000
2011-01-01 04:00:00    243.200000
2011-01-01 05:00:00    221.400000
2011-01-01 06:00:00    227.400000
2011-01-01 07:00:00    271.800000
2011-01-01 08:00:00    279.000000
2011-01-01 09:00:00    344.400000
Freq: H, dtype: float64

2011-01-01 00:00:00    231.0
2011-01-01 01:00:00    288.0
2011-01-01 02:00:00    288.0
2011-01-01 03:00:00    372.0
2011-01-01 04:00:00    372.0
2011-01-01 05:00:00    372.0
2011-01-01 06:00:00    318.0
2011-01-01 07:00:00    491.0
2011-01-01 08:00:00    491.0
2011-01-01 09:00:00    491.0
Freq: H, dtype: float64

### 6.8.2 Converting from strings to timestamps

In [72]:
# converting 
print(pandas.to_datetime(pandas.Series(['Jul 31, 2009', '2010-01-10', None])))
print()
print(pandas.to_datetime(['2005/11/23', '2010.12.31']))
print()

# European style dates:
print(pandas.to_datetime(['04-01-2012 10:00'], dayfirst=True))
print()
print(pandas.to_datetime(['14-01-2012', '01-14-2012'], dayfirst=True))
print()

# from epochs:
print(pandas.to_datetime([1349720105, 1349806505, 1349892905, 
                          1349979305, 1350065705], unit='s'))

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

DatetimeIndex(['2005-11-23', '2010-12-31'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2012-01-04 10:00:00'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2012-01-14', '2012-01-14'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

## Exercise 6.8